content/blog/h/fullbooks.org
:PROPERTIES:
:ID:       omy9ejo02wj0
:END:
#+TITLE: Bibliography
#+options: toc:t
#+cite_export: csl  harvard.csl
#+filetags: :books:
#+HTML_HEAD_EXTRA: <script>document.addEventListener('DOMContentLoaded', () => document.body.classList.add('page-books'));</script>
#+MACRO: inc #+INCLUDE: "$1::#bk" :only-contents t
#+DATE: <2022-12-26 Mon 02:14>

#+begin_export HTML
<head>
<style>


@media screen and (max-width: 1089px) {

.org-ul {
font-size: 13px;
    padding: 0;

}

}

p:has(> a:target) {
  background-color: #ffa;
}


  .footdef {
    display: block !important;
  }

.tag span {
    float: right;
    margin-right: 0.5em;
    border: 1px solid #bbb;
    border-radius: 3px;
    background-clip: padding-box;
    color: #333;
    background-color: #eee;
    line-height: 1;
}

.org-ul {
}

# .sidenote {
#         display: none;
# }


.sidenote a, .footpara a {
    word-break: break-all !important;
}

  .footnotes {
    display: block !important;
  }
</style>
</head>
#+end_export

- [2025-11-22 Sat 03:01] I had a "he is literally me" reading a biography about [[id:ynx5yta0uwj0][Leonadrdo da Vinci]]: "His notebooks are ﬁlled with lists of books he acquired and passages he copied."[cite:@isaacson-2017-leonar-vinci]

These are neither the books I recommend nor the ones I countenance their views.
This is a list of the documents/textbooks that I own (either physically or
digitally), with some side notes that could be helpful.
- [2024-10-01 Tue 17:37] A useful source for cultures and arts http://www.infocobuild.com/
- [2023-10-03 Tue 05:13] If you are looking for new courses/topics to learn
  about, it's highly recommended that you watch this lecture by professor [[id:5a780a66-e9ff-4712-8269-3d1cd1556c95][Noam Chomsky]]:
  https://youtu.be/2p9aKa08cRI [fn:1]
- [2023-03-06 Mon 00:13] I added some papers here too, I think this makes the
  'books' title a little bit misleading. Also I moved the books I regret
  reading, or the ones I wouldn't definitely reread to the "inexpedient" [fn:8]
  sections.
