content/blog/h/fullbooks.org
** Literature
This section will not be updated anymore.

This section will not be updated anymore

- [2025-06-16 Mon 23:35] Also see this interesting part by [[id:34zfdap0slk0][Kierkegaard on fiction]]:
  #+begin_quote
  What does the soul find so recuperative about reading fairy-tales? When I am tired of everything and ‘full of days’,
  fairy-tales are for me always the refreshing bath that proves so beneficial. There all earthly, all finite cares vanish; joy,
  yes sorrow even, are infinite (which is just why they are so expanding and beneficial). One sets out to find the
  bluebird, just like the princess who, chosen to be queen, lets someone else take care of the kingdom so that she
  herself can seek out her unhappy lover. What infinite sorrow is implied in her saying to the old woman she meets, as
  she roams about dressed as a peasant girl: ‘I am not alone, good mother, I have with me a great following of trouble,
  cares and suffering.’ […]
  #+end_quote
- [2023-10-24 Tue 18:19]  I wrote the sentence above "This section will not be updated anymore" years
  ago, after a discussion with someone that really convinced me that reading
  literature is an absolute waste of time, since it is not possible to extract
  concrete expressive knowledge, at best it might help you at giving parables
  before telling a theory, making you look more eloquent. I also believe that it
  might deeply help in understanding how people might act in some situation,
  literature is human experience after all. What I've understood recently is
  that [[id:4y03zoa1bxj0][entertainment]] is necessary in man's life, no matter how disciplined and
  optimized you are, at some point you will need a rest, whereupon you will be
  interested in an ease and have two options cinema and TV /or/ literature. Here
  you can see where this is going. Sadly, the current state of producing art
  forms it onto a mere proprietor tool used for whatever reasons.  Although
  literature always has been like that [cite:see for example @mccall-2021-money-as],
  but much less if compared to media [cite:@alford-2018-screen-enter].
  One can actually tell that the major reveal of "correctness" was a recent
  change in media. If you are like me, you won't be much interesting in watching
  works from the 30s to avoid that, however, people can easily read works from
  past centuries without a problem. So, this

قال مُخلِد بن حسين (تـ191 هـ) لابن المبارك: "نحنُ إلى كثيرٍ من الأدب أحوَجَ منّا إلى كثيرٍ من
الحديث".

- [[id:kq94aly0jxj0][Ḥayy ibn Yaqẓān]] (Ibn Tufayl et al.)
- [[id:zv7b8b11j2k0][Don Quixote]] (Cervantes, M. d.)
- [[id:c1o0ayi0yrk0][Biyad wa Riyad]] (Arbnikel)
- [[id:o1g4vx50dak0][Rameau's Nephew and First Satire]] (Diderot, D.)
- [[id:mppbrof0r1k0][The Double and The Gambler]] (Dostoevsky, F.)
- [[id:wned02a160k0][The Faerie Queene]] (Spenser, E.)
- [[id:eiseq6b0m0k0][The Bride of Lammermoor]] (Scott, W)
- [[id:z80b389160k0][The Canterbury Tales, and Other Poems]] (Chaucer, G.)
- [[id:69bg8u0134k0][Complete Works of Frans Kafka]] (Kafka, F.)
- [[id:ntgexwn0y9k0][Manfred]] (Byron, L)
- [[id:y897k9d0lak0][The Lover]] (Duras, M.)
- [[id:waa5fah08ek0][Ibn Sina or The Road to Isfahan]] (Sinoue, G.) [fn:-15-2]
- [[id:a3u7c130gek0][Selected Works]] (Chekhov, A.)
- [[id:wmm5i030iek0][Siddhartha]] (Hesse, H.)
- [[id:2fz7p261nkk0][Momo]] (Ende, M.)
- A Streetcar Named Desire (Williams, T)
- [[id:60c1de65-8fde-4300-af26-124bbc984a45][The Kite Runner]] (Khalid, H)
- Lolita (Nabokob, V)
- Suddenly Last Summer (Williams, T)
- [[id:538ejds0uzj0][The Brothers Karamazov]] (Dostoevsky, F)
- Umm Sa'd (Ghassan, K)
- Children of the Alley (Mahfouz, N)
- Cat on a Hot Tin Roof (Williams, T)
- Crime and Punishment (Dostoevsky, F)
- The Idiot (Dostoevsky, F)
- Orpheus Descending (Williams, T)
- Marx in Soho (Zinn, H)
- One Arm and Other Stories (Williams, T)
- The Misunderstanding (Camus)
- Notes from Underground (Dostoevsky, F)
- Crime and Punishment (Dostoevsky, F)
- The Dream of a Ridiculous Man (Dostoevsky, F)
- Chronicle of a Death Foretold (Márquez, G)
- The Unbearable Lightness of Being (Kundera, M)
- Poor Folk (Dostoevsky, F)
- In the Penal Colony (Kafka, F)
- Men in the Sun (Kanafani, G)
- Animal Farm (Orwell, G)
- Karnak Kafe (Mahfouz, N)
- The Insulted and Humiliated (Dostoevsky, F)
- Love in the Time of Cholera (Márquez, G)
- One Hundred Years of Solitude (Márquez, G)
- Adrift on the Nile (Mahfouz, N)
- The Overcoat (Gogol, N)
- The Land of Sad Oranges (Kanafani, G)
- The Bet and Other Stories (Chekhov, A)
- [[id:g7o3v2v090k0][The Death of Ivan Ilyich & Confession]]  (Tolostoy, L)
- The Picture of Dorian Gray (Wilde, O)
- 1984 (Orwell, G)
- The Festival of Insignificance (Kundera, M)
- When Nietzsche Wept (Yalom, I)
- The Death of a Government Clerk (Gogol, N)
- The Silent Patient (Michaelides, A)
- Season of Migration to the North (Salih, A)
- The Inspector General (Gogol, N)
- Oscar And The Lady In Pink (Schmitt, E)
- No One Sleeps in Alexandria (AbdelMeguid, I)
- يوم غائم في البر الغربي (قنديل، م)
- Alexander Pope: Selected Works (Pope, A)
- [[id:74d63dbe-10b6-42f9-b562-ed75b030ca23][Agamemnon]] (Aeschylus, A)
- A Confession (Tolstoy, L)
- [[id:044lps019wj0][Make Something Up]] (Palahniuk, C)
- [[id:jb7i11x06xj0][Fight Club]] (Palahniuk, C.)
- [[id:0697ihs0yzj0][The Antiquary]] (Scott, W.)
- القميص المسروق (كنفاني، غ)
- الزيتون لا يموت (نصر، ع)
- [[id:kdq76by0vck0][Letters from Ansi al-Hajj to Ghada al-Samman]] (al-Haj, A.)
- [[id:je7d7rc0xck0][Letters from Ghassan Kanafani to Ghada al-Samman]] (Kanafani, G.)

Ones I didn't enjoy reading:

- Memories of My Melancholy Whores (Márquez, G.)[fn:-15-1]
- The Metamorphosis
- Hidden Figures
- War and Peace
- Wind, Sand and Stars
- Testaments Betrayed, An Essay in Nine Parts
- A Tale of Two Cities
- The Hunchback of Notre-Dame
- Sundays in August
- الحكايات الشعبية من آسيا
- [[id:18dc9758-c629-434f-85ec-0153cf5eeeda][A Confession]] (Tolstoy, L)

