static/~saleh/fullbooks.html
<div id="outline-container-org0bef65f" class="outline-3">
<h3 id="org0bef65f">Literature</h3>
<div class="outline-text-3" id="text-org0bef65f">
<p>
This section will not be updated anymore.
</p>

<p>
This section will not be updated anymore
</p>

<ul class="org-ul">
<li><p>
<span class="timestamp-wrapper"><span class="timestamp">[2025-06-16 Mon 23:35]</span></span> Also see this interesting part by Kierkegaard on fiction:
</p>
<div class="epigraph"><blockquote>
<p>
What does the soul find so recuperative about reading fairy-tales? When I am tired of everything and ‘full of days’,
fairy-tales are for me always the refreshing bath that proves so beneficial. There all earthly, all finite cares vanish; joy,
yes sorrow even, are infinite (which is just why they are so expanding and beneficial). One sets out to find the
bluebird, just like the princess who, chosen to be queen, lets someone else take care of the kingdom so that she
herself can seek out her unhappy lover. What infinite sorrow is implied in her saying to the old woman she meets, as
she roams about dressed as a peasant girl: ‘I am not alone, good mother, I have with me a great following of trouble,
cares and suffering.’ […]
</p>

</blockquote></div></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2023-10-24 Tue 18:19]</span></span>  I wrote the sentence above &ldquo;This section will not be updated anymore&rdquo; years
ago, after a discussion with someone that really convinced me that reading
literature is an absolute waste of time, since it is not possible to extract
concrete expressive knowledge, at best it might help you at giving parables
before telling a theory, making you look more eloquent. I also believe that it
might deeply help in understanding how people might act in some situation,
literature is human experience after all. What I&rsquo;ve understood recently is
that entertainment is necessary in man&rsquo;s life, no matter how disciplined and
optimized you are, at some point you will need a rest, whereupon you will be
interested in an ease and have two options cinema and TV <i>or</i> literature. Here
you can see where this is going. Sadly, the current state of producing art
forms it onto a mere proprietor tool used for whatever reasons.  Although
literature always has been like that (see for example <a href="#citeproc_bib_item_6">McCall, 2021</a>),
but much less if compared to media (<a href="#citeproc_bib_item_1">Alford, 2018</a>).
One can actually tell that the major reveal of &ldquo;correctness&rdquo; was a recent
change in media. If you are like me, you won&rsquo;t be much interesting in watching
works from the 30s to avoid that, however, people can easily read works from
past centuries without a problem. So, this</li>
</ul>

<p>
قال مُخلِد بن حسين (تـ191 هـ) لابن المبارك: &ldquo;نحنُ إلى كثيرٍ من الأدب أحوَجَ منّا إلى كثيرٍ من
الحديث&rdquo;.
</p>

<ul class="org-ul">
<li>Ḥayy ibn Yaqẓān (Ibn Tufayl et al.)</li>
<li>Don Quixote (Cervantes, M. d.)</li>
<li>Biyad wa Riyad (Arbnikel)</li>
<li>Rameau&amp;rsquo;s Nephew and First Satire (Diderot, D.)</li>
<li>The Double and The Gambler (Dostoevsky, F.)</li>
<li>The Faerie Queene (Spenser, E.)</li>
<li>The Bride of Lammermoor (Scott, W)</li>
<li>The Canterbury Tales, and Other Poems (Chaucer, G.)</li>
<li>Complete Works of Frans Kafka (Kafka, F.)</li>
<li>Manfred (Byron, L)</li>
<li>The Lover (Duras, M.)</li>
<li>Ibn Sina or The Road to Isfahan (Sinoue, G.) <label for="54" class="margin-toggle sidenote-number"></label><input type="checkbox" id="54" class="margin-toggle"/><span class="sidenote">
Not a very nice work, I&rsquo;d prefer Youssef Ziedan&rsquo;s novel about Ibn Sina. I never
thought of Ibn Sina in such an erotic context, ever.
</span></li>
<li>Selected Works (Chekhov, A.)</li>
<li>Siddhartha (Hesse, H.)</li>
<li>Momo (Ende, M.)</li>
<li>A Streetcar Named Desire (Williams, T)</li>
<li>The Kite Runner (Khalid, H)</li>
<li>Lolita (Nabokob, V)</li>
<li>Suddenly Last Summer (Williams, T)</li>
<li>The Brothers Karamazov (Dostoevsky, F)</li>
<li>Umm Sa&rsquo;d (Ghassan, K)</li>
<li>Children of the Alley (Mahfouz, N)</li>
<li>Cat on a Hot Tin Roof (Williams, T)</li>
<li>Crime and Punishment (Dostoevsky, F)</li>
<li>The Idiot (Dostoevsky, F)</li>
<li>Orpheus Descending (Williams, T)</li>
<li>Marx in Soho (Zinn, H)</li>
<li>One Arm and Other Stories (Williams, T)</li>
<li>The Misunderstanding (Camus)</li>
<li>Notes from Underground (Dostoevsky, F)</li>
<li>Crime and Punishment (Dostoevsky, F)</li>
<li>The Dream of a Ridiculous Man (Dostoevsky, F)</li>
<li>Chronicle of a Death Foretold (Márquez, G)</li>
<li>The Unbearable Lightness of Being (Kundera, M)</li>
<li>Poor Folk (Dostoevsky, F)</li>
<li>In the Penal Colony (Kafka, F)</li>
<li>Men in the Sun (Kanafani, G)</li>
<li>Animal Farm (Orwell, G)</li>
<li>Karnak Kafe (Mahfouz, N)</li>
<li>The Insulted and Humiliated (Dostoevsky, F)</li>
<li>Love in the Time of Cholera (Márquez, G)</li>
<li>One Hundred Years of Solitude (Márquez, G)</li>
<li>Adrift on the Nile (Mahfouz, N)</li>
<li>The Overcoat (Gogol, N)</li>
<li>The Land of Sad Oranges (Kanafani, G)</li>
<li>The Bet and Other Stories (Chekhov, A)</li>
<li>The Death of Ivan Ilyich &amp;amp; Confession  (Tolostoy, L)</li>
<li>The Picture of Dorian Gray (Wilde, O)</li>
<li>1984 (Orwell, G)</li>
<li>The Festival of Insignificance (Kundera, M)</li>
<li>When Nietzsche Wept (Yalom, I)</li>
<li>The Death of a Government Clerk (Gogol, N)</li>
<li>The Silent Patient (Michaelides, A)</li>
<li>Season of Migration to the North (Salih, A)</li>
<li>The Inspector General (Gogol, N)</li>
<li>Oscar And The Lady In Pink (Schmitt, E)</li>
<li>No One Sleeps in Alexandria (AbdelMeguid, I)</li>
<li>يوم غائم في البر الغربي (قنديل، م)</li>
<li>Alexander Pope: Selected Works (Pope, A)</li>
<li>Agamemnon (Aeschylus, A)</li>
<li>A Confession (Tolstoy, L)</li>
<li>Make Something Up (Palahniuk, C)</li>
<li>Fight Club (Palahniuk, C.)</li>
<li>The Antiquary (Scott, W.)</li>
<li>القميص المسروق (كنفاني، غ)</li>
<li>الزيتون لا يموت (نصر، ع)</li>
<li>Letters from Ansi al-Hajj to Ghada al-Samman (al-Haj, A.)</li>
<li>Letters from Ghassan Kanafani to Ghada al-Samman (Kanafani, G.)</li>
</ul>

<p>
Ones I didn&rsquo;t enjoy reading:
</p>

<ul class="org-ul">
<li>Memories of My Melancholy Whores (Márquez, G.)<label for="55" class="margin-toggle sidenote-number"></label><input type="checkbox" id="55" class="margin-toggle"/><span class="sidenote">
(<span class="timestamp-wrapper"><span class="timestamp">[2024-07-22 Mon 18:23]</span></span>) One of the most distasteful works I&rsquo;ve ever read.
</span></li>
<li>The Metamorphosis</li>
<li>Hidden Figures</li>
<li>War and Peace</li>
<li>Wind, Sand and Stars</li>
<li>Testaments Betrayed, An Essay in Nine Parts</li>
<li>A Tale of Two Cities</li>
<li>The Hunchback of Notre-Dame</li>
<li>Sundays in August</li>
<li>الحكايات الشعبية من آسيا</li>
<li>A Confession (Tolstoy, L)</li>
</ul>
</div>
</div>
