content/blog/h/fullbooks.org
** Heritage
*Note*: the author names in this list are to be fixed, there is a small bug in
the script I use to generate them, and I'm too lazy to check for them by hand.

- [[id:fggh95a1ajk0][Muhadarat al-Udaba]] (Isfahani, A.)
- [[id:fnp5rx61ock0][Nawadir al-Ayk]] (Suyuti, A.)
- المقامات (الزمخشري، ج)
- كتاب الأمالي (القالي، أ)
- فقه القلوب (التويجري، م)
- فضائل الأعمال (المقدسي، ض)
- لباب الأداب (منقذ، أ)
- كتاب المِحن (التميمي، أ)
- روضة العقلاء (حبان، ا)
- تصفية القلوب (الذماري، ي)
- البيان والتبيان (الحاحظ، أ)
- شرح كتاب الشهاب (القضياعي، أ)
- الوابل الطيب (الجوزية، أ)
- العزلة (البستي، م)
- المنازل والديار (منقذ، أ)
- العزلة والانفراد (الدنيا، أ)
- الزهد الكبير (البيهقي)
- الإعتبار (أسامه بن منقذ)
- أحسن ما سمعت (الثعالبي)
- أدب الدين والدنيا (الماوردي، أ)
- الفوائد (الجوزية، ا)
- الفرج بعد الشدة (التنوخي، ع)
- أخبار الظراف ومتماجنين (ابن الجوزي، أ)
- نسمة السحر (الحريري، ب)
- جواهر الحكم (ابن يعلى، ع)
- أنيس المسافر وجليس الخاطر (البحراني، ع)
- روائع الكلم في شرح قصار الحكم (العجلوني، ج)
- تحف العقول عن آل الرسول (التستري، ع)
- مِصباحُ المُتَهجِّد وسلاحُ المُتَعَبّد (الزركشي، م)
- عيون الأخبار (ابن قتيبة، ع)
- سمط الآلي (العقاد، ع)
- زهرة الأكم (الحريري، ب)
- بهجة المجالس (ابن حجر، أ)
- الموازنة بين أبي تمام والبحترى (السمرقندي، ع)
- بين الثقافة والسياسة (العتيبي، ط)
- العقد الفريد (الأصفهاني، ع)
- التذكرة الحمدونية (القرطبي، ا)
- المستطرف في كل فن مستظرف (الغزالي، ا)
- إحياء علوم الدين (الغزالي، ا)
- مدارج السالكين (ابن القيم، ا)
- الإمتاع والمؤانسة (التوحيدي، م)
- النساء في لوحات المستشرقين (الباز، ل)
- اتحاف النبلاء بأخبار الثقلاء (الحراني، ع)
- ألف باء في أنواع الآداب (الجاحظ، ع)
** Poetry
- [[id:hjnk8t4160k0][The Norton Anthology of Poetry]] (Ferguson et al.)
- [[id:x3027m41x2k0][Abuzun al-Omani's Poetry]] (al-Omani, A.)
- [[id:0c5gqav0e4k0][Hamasah]] (Tamam, H.)
- [[id:1qfh0oa0k5k0][al-Tibyan fi Sharh al-Diwan]] (al-Akbari, A.)
- [[id:yw9dphj0tgk0][al-Mutanabbi]] (Shakir, M. M.)
- [[id:vlng7aa0omk0][Nietzsche's Poetry]] (Nietzsche, F.)
- [[id:zox83l50yrk0][Mahmoud Sami al-Barudi]] (al-Barudi, M. S.)
*** hide                                                              :noexport:
- [[id:d045cf59-16a3-46de-8eb8-cc04f6312cce][تأبط شرًا]]
- [[id:ade2f549-9762-48d5-a0b7-2c58fbb15dc9][أبو تمام]]
- [[id:743e68eb-cb88-418b-9833-85f0bf9ac87d][الشريف المرتضى]]

* Chess

- [[id:69af51e3-318f-4055-867c-7f6b8eba39c5][Play Winning Chess]] (Seirawan, W)[fn:-18-1]
- A First Book of Morphy (Lawson, D)
- Chess Openings for Dummies (Eade, J)
- 7 Deadly Chess Sins (Rowson, J)
- Improve Your Chess Pattern Recognition (Oudeweetering, A)
- The Soviet Chess Primer (Maizelis, I)
- Logical Chess: Move by Move (Chernev, I)

* Current                                                             :noexport:
Reading:
- [[id:2cj25u00sxj0][Invisible Var: The US and The Iraq Sanctions]] (Gordon, J)
- [[id:kq94aly0jxj0][Ḥayy ibn Yaqẓān]] (Zidan, Y)
- [[id:6ad40bm0nwj0][The Thoughts of Marcus Aurelius]] (Aurelius, M.)
- [[id:jb7i11x06xj0][Fight Club]] (Palahniuk, C.)
- [[id:044lps019wj0][Make Something Up]] (Palahniuk, C.)
- [[id:45fdc50f-6b08-4555-a1dd-417074349cbd][Our Oriental Heritage]] (Durant, W.)
- [[id:ae695d0f-04a6-4398-9785-0a4e925d689b][History of The French Revolution]] (Soboul, A.)
- [[id:aa974737-5070-4652-985d-2a7a2ad198e9][History of the Western Philosophy and Theologyy]] (Frame, J. M.)
- [[id:1f939ce6-6cba-43b6-a19b-4b78890be45b][The Open Society and its Enemies]] (Popper, K. R.)
- [[id:3fxhry418xj0][Islam and The Destiny of Man]] (Eaton, G)
- [[id:6y7buw40uwj0][The Polymath]] (Ahmed, W)
* Other
- [[id:w083zt618xj0][The Subtle Art of Not Giving a F*ck]] (Manson, M.).
- [[id:t8w6y3j0dxj0][Why is it so hard to do my work?]] (Leroy, S.)
- [[id:2qv2wq71yxj0][Ubersleep: Nap-based Sleep Schedules and the Polyphasic Lifestyle]] (Doxyk, P)
- [[id:4fih09l0f4k0][Qusr al-Kalam]] (Amer, G.)
- [[id:b20c7yy026k0][Discipline is Destiny]] (Holiday, R.)
* wt                                                                  :noexport:
[fn:7] Pretty much up-to-date version of "The Protocols of the Elders of Zion".

[fn:6]   I think this book could make a use for me in the future in giving instances of
  how most of philosophy authors & books are either pointless or obscure.
[fn:5]   It's sad that non-scientific (in the academic means) Islamic scholars can not
  write a readable argument without bloat it with x10 hate and swearing.


[fn:4]   Mernissi forces herself to act like an orientalist, however she ain't. Since I
  can't write a lot in this small box, I'd like to point 3 important issues in
  this dissertation; 1. Usage of past-criticized Takhrij of some Hadiths, which
  was claimed by her in /Political Harem: The Prophet and Women/ that it cannot
  be noted after the prophet, but was 'made up' for interests. 2. Which is sorta
  correlated with 1, is the inference from history book like Tabaqat al-Kubra.
  We can not tell what is 'Islamic' based on such late area of the Islamic
  History. However, if Mernissi surfs what is told to be 'Islamic', not what is
  'Islamic', those 2 points are not valid. 3. Al-Ghazali used to address his
  students that were always men, which clarify why he gives advices about
  treating women, I couldn't interpret it like Mernissi did, that he meant
  'Women are tools for men to help them pass through the hurdles of life'. This
  is meaningless.

[fn:3]  A prelude of the human history from the 'civilization' perspective, a
  deep-rooted academic corresponding would be Will Durant's first chapter of
  "The Full Story of Civilization", Our Oriental Heritage. Russel's book is good
  for having a good time with a book “The time
 

[fn:2] An inequilateral note about reading /philosophy/; the vast majority of
philosophy books is not worth reading, in fact it's painful to read it, which is
a thing I realized too late (~1 year ago, thanks to a friend of mine allowed me
to read his dissertation in /Obscurantism/ of philosophers), a lot of philosophy
books I've read in my life was useful but not really that 'useful', this is not
the best place to explain why, but I'll talk about this in the future Inshaa'
Allah. Also, read [[https://sophy.ca/blog/2013/03/how-not-to-write-in-philosophy/][How not to write in philosophy -- Against obscurantism]].

# [fn:1] Not a bad book after all, it sounds like neo-Nazis are one of the rare
#   denomination that preserved some فِطرة and genuine values. Some of the quotes I
#   liked:

# Unfounded belief is pitfall. A People who do not check the validity and effect
# of their beliefs with reason will suffer or perish.

# In a democracy those who control the media, and thus the minds of the
# electorate, have power undreamed by kings or dictators.

# Propaganda is major component in all power systems, both secular and religious;
# false propaganda is a major component of unprincipled power systems. All power
# systems endeavor to convince their subjects that the system is good, just,
# beneficent and noble, as well as worthy of perpetuation and defense. The more
# jingoistic propaganda issued, the more suspicious one should be of its truth.

# There exists no such thing as rights or privileges under the Laws of Nature. The
# deer being stalked by a hungry lion has no right to life. However, he may
# purchase life by obedience to nature ordained instincts for vigilance and
# flight. Similarly, men have no rights to life, liberty or happiness. These
# circumstances may be purchased by oneself, by ones family, by ones tribe or by
# ones ancestors, but they are nonetheless purchases and are not rights.
# Furthermore, the value of these purchases can only be maintained through
# vigilance and obedience to Natural Law.

# Tyrannies teach what to think; free men learn how to think.

# Sexual pornography degrades the Nature of all who are involved. A beautiful nude
# woman is art; a camera between her knees to explore her private parts is
# pornography. [I think he meant by pornography at the end as pornography in its
# root Grecian meaning (dirt)]

* References
#+print_bibliography:

