static/~saleh/fullbooks.html
<div id="outline-container-org06ca35b" class="outline-3">
<h3 id="org06ca35b">Heritage</h3>
<div class="outline-text-3" id="text-org06ca35b">
<p>
<b>Note</b>: the author names in this list are to be fixed, there is a small bug in
the script I use to generate them, and I&rsquo;m too lazy to check for them by hand.
</p>

<ul class="org-ul">
<li>Muhadarat al-Udaba (Isfahani, A.)</li>
<li>Nawadir al-Ayk (Suyuti, A.)</li>
<li>المقامات (الزمخشري، ج)</li>
<li>كتاب الأمالي (القالي، أ)</li>
<li>فقه القلوب (التويجري، م)</li>
<li>فضائل الأعمال (المقدسي، ض)</li>
<li>لباب الأداب (منقذ، أ)</li>
<li>كتاب المِحن (التميمي، أ)</li>
<li>روضة العقلاء (حبان، ا)</li>
<li>تصفية القلوب (الذماري، ي)</li>
<li>البيان والتبيان (الحاحظ، أ)</li>
<li>شرح كتاب الشهاب (القضياعي، أ)</li>
<li>الوابل الطيب (الجوزية، أ)</li>
<li>العزلة (البستي، م)</li>
<li>المنازل والديار (منقذ، أ)</li>
<li>العزلة والانفراد (الدنيا، أ)</li>
<li>الزهد الكبير (البيهقي)</li>
<li>الإعتبار (أسامه بن منقذ)</li>
<li>أحسن ما سمعت (الثعالبي)</li>
<li>أدب الدين والدنيا (الماوردي، أ)</li>
<li>الفوائد (الجوزية، ا)</li>
<li>الفرج بعد الشدة (التنوخي، ع)</li>
<li>أخبار الظراف ومتماجنين (ابن الجوزي، أ)</li>
<li>نسمة السحر (الحريري، ب)</li>
<li>جواهر الحكم (ابن يعلى، ع)</li>
<li>أنيس المسافر وجليس الخاطر (البحراني، ع)</li>
<li>روائع الكلم في شرح قصار الحكم (العجلوني، ج)</li>
<li>تحف العقول عن آل الرسول (التستري، ع)</li>
<li>مِصباحُ المُتَهجِّد وسلاحُ المُتَعَبّد (الزركشي، م)</li>
<li>عيون الأخبار (ابن قتيبة، ع)</li>
<li>سمط الآلي (العقاد، ع)</li>
<li>زهرة الأكم (الحريري، ب)</li>
<li>بهجة المجالس (ابن حجر، أ)</li>
<li>الموازنة بين أبي تمام والبحترى (السمرقندي، ع)</li>
<li>بين الثقافة والسياسة (العتيبي، ط)</li>
<li>العقد الفريد (الأصفهاني، ع)</li>
<li>التذكرة الحمدونية (القرطبي، ا)</li>
<li>المستطرف في كل فن مستظرف (الغزالي، ا)</li>
<li>إحياء علوم الدين (الغزالي، ا)</li>
<li>مدارج السالكين (ابن القيم، ا)</li>
<li>الإمتاع والمؤانسة (التوحيدي، م)</li>
<li>النساء في لوحات المستشرقين (الباز، ل)</li>
<li>اتحاف النبلاء بأخبار الثقلاء (الحراني، ع)</li>
<li>ألف باء في أنواع الآداب (الجاحظ، ع)</li>
</ul>
</div>
</div>
<div id="outline-container-org7f645d0" class="outline-3">
<h3 id="org7f645d0">Poetry</h3>
<div class="outline-text-3" id="text-org7f645d0">
<ul class="org-ul">
<li>The Norton Anthology of Poetry (Ferguson et al.)</li>
<li>Abuzun al-Omani&amp;rsquo;s Poetry (al-Omani, A.)</li>
<li>Hamasah (Tamam, H.)</li>
<li>al-Tibyan fi Sharh al-Diwan (al-Akbari, A.)</li>
<li>al-Mutanabbi (Shakir, M. M.)</li>
<li>Nietzsche&amp;rsquo;s Poetry (Nietzsche, F.)</li>
<li>Mahmoud Sami al-Barudi (al-Barudi, M. S.)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5fee8e8" class="outline-2">
<h2 id="org5fee8e8">Chess</h2>
<div class="outline-text-2" id="text-org5fee8e8">
<ul class="org-ul">
<li>Play Winning Chess (Seirawan, W)<label for="56" class="margin-toggle sidenote-number"></label><input type="checkbox" id="56" class="margin-toggle"/><span class="sidenote">
I wish if I&rsquo;ve started with this book instead of chess for dummies.
</span></li>
<li>A First Book of Morphy (Lawson, D)</li>
<li>Chess Openings for Dummies (Eade, J)</li>
<li>7 Deadly Chess Sins (Rowson, J)</li>
<li>Improve Your Chess Pattern Recognition (Oudeweetering, A)</li>
<li>The Soviet Chess Primer (Maizelis, I)</li>
<li>Logical Chess: Move by Move (Chernev, I)</li>
</ul>
</div>
</div>
<div id="outline-container-org73dd0f5" class="outline-2">
<h2 id="org73dd0f5">Other</h2>
<div class="outline-text-2" id="text-org73dd0f5">
<ul class="org-ul">
<li>The Subtle Art of Not Giving a F*ck (Manson, M.).</li>
<li>Why is it so hard to do my work? (Leroy, S.)</li>
<li>Ubersleep: Nap-based Sleep Schedules and the Polyphasic Lifestyle (Doxyk, P)</li>
<li>Qusr al-Kalam (Amer, G.)</li>
<li>Discipline is Destiny (Holiday, R.)</li>
</ul>
</div>
</div>
